import parser

class TestSuite():
    def test_iperf3_client_connection(self, client):
        """
        У цьому тест-кейсі, ми перевіряємо пропускну здатність, тобто за допомогою виводу
        iperf-клієнта переконуємося
        в тому, що значення у межах норми, та не менші певного значення.
        Також, перед цим, треба переконатися, що клієнт не повертає помилку. Для цього
        достатньо перевірити, що
        фікстура клієнта повертає порожню помилку stderr
        :param client: Викликаємо фікстуру клієнта
        """
        assert True
